tutorials/incompressible/pimpleFoam/TJunctionFan/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        U               U;
        phi             phi;
        value           uniform 1;
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    baffles
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
    fan_half0
    {
        type            cyclic;
    }
    fan_half1
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
